Revit 2027 API
BuiltInFailures.OpeningFailures.OpeningRectDoesnotCutHost Property
 Rectangular opening doesn't cut its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpeningRectDoesnotCutHost { get; }
Public Shared ReadOnly Property OpeningRectDoesnotCutHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpeningRectDoesnotCutHost {
	FailureDefinitionId^ get ();
}
static member OpeningRectDoesnotCutHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace